### Snapshot Service Plan: success

<details><summary>Show Plan</summary>

```
module.daily_snapshot.data.local_file.init: Reading...
module.daily_snapshot.data.external.sources_tar: Reading...
module.daily_snapshot.data.local_file.init: Read complete after 0s [id=e80e365c1b7ffeda59e269f36520c888158b2d71]
module.daily_snapshot.data.external.sources_tar: Read complete after 0s [id=-]
module.daily_snapshot.data.local_file.sources: Reading...
module.daily_snapshot.data.digitalocean_ssh_keys.keys: Reading...
module.daily_snapshot.digitalocean_volume.forest_storage: Refreshing state... [id=485e2871-ed79-11ed-b28e-0a58ac14d286]
module.daily_snapshot.data.digitalocean_project.forest_project: Reading...
module.daily_snapshot.data.local_file.sources: Read complete after 0s [id=5713a22415ee81c862e601e56add2f2126b13858]
module.daily_snapshot.data.digitalocean_ssh_keys.keys: Read complete after 0s [id=ssh_keys/10962629775372992364]
module.daily_snapshot.digitalocean_droplet.forest: Refreshing state... [id=357268892]
module.daily_snapshot.digitalocean_volume_attachment.attach_forest_storage: Refreshing state... [id=357268892-485e2871-ed79-11ed-b28e-0a58ac14d286-20230526073427573800000001]
module.daily_snapshot.digitalocean_firewall.forest-firewall: Refreshing state... [id=d1126156-0675-41ec-a6db-cd30d4768db6]
module.daily_snapshot.data.digitalocean_project.forest_project: Read complete after 1s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.daily_snapshot.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.daily_snapshot.digitalocean_droplet.forest must be replaced
-/+ resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2023-05-26T07:33:29Z" -> (known after apply)
      ~ disk                 = 300 -> (known after apply)
      ~ id                   = "357268892" -> (known after apply)
      ~ ipv4_address         = "209.38.248.210" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.3" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 16384 -> (known after apply)
        name                 = "forest-snapshot"
      ~ price_hourly         = 0.19494 -> (known after apply)
      ~ price_monthly        = 131 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ ssh_keys             = [ # forces replacement
          - "09:b6:09:ef:ac:23:8a:94:df:3e:b9:9b:28:8d:c8:6f",
          - "58:d8:c7:2a:ce:84:ca:41:10:06:93:35:34:6d:eb:a2",
          - "68:35:f7:50:11:68:7b:df:9d:6a:49:83:eb:e9:37:20",
          - "93:73:5f:22:81:11:ae:80:f0:63:0d:a7:09:4b:2d:2a",
          - "a1:82:1c:8d:82:65:91:0f:3b:ca:06:37:6f:e0:5a:11",
          - "a4:01:b5:d9:4c:3f:93:71:9b:02:83:66:5e:4f:62:25",
          - "fa:f4:ba:d9:24:81:12:25:88:43:3a:f0:07:7c:af:6e",
          + "fa:62:10:64:1b:77:eb:78:a5:ba:e0:86:ff:76:7e:97",
            # (16 unchanged elements hidden)
        ]
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "iac",
        ]
      ~ urn                  = "do:droplet:357268892" -> (known after apply)
      ~ vcpus                = 2 -> (known after apply)
      ~ volume_ids           = [
          - "485e2871-ed79-11ed-b28e-0a58ac14d286",
        ] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.daily_snapshot.digitalocean_firewall.forest-firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest-firewall" {
      ~ droplet_ids     = [
          - 357268892,
        ] -> (known after apply)
        id              = "d1126156-0675-41ec-a6db-cd30d4768db6"
        name            = "forest-snapshot"
        tags            = []
        # (3 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.daily_snapshot.digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:357268892",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.daily_snapshot.digitalocean_volume_attachment.attach_forest_storage must be replaced
-/+ resource "digitalocean_volume_attachment" "attach_forest_storage" {
      ~ droplet_id = 357268892 # forces replacement -> (known after apply) # forces replacement
      ~ id         = "357268892-485e2871-ed79-11ed-b28e-0a58ac14d286-20230526073427573800000001" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

Changes to Outputs:
  ~ ip = [
      - [
          - "209.38.248.210",
        ],
      + [
          + (known after apply),
        ],
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>